# HWallHeight

## Description
_Vectorworks 2012 Deprecated Functions_. See architectural category for replacement:
:DelObjStoryBound
:DelObjStoryBounds
:GetObjBoundElevation
:GetObjStoryBound
:GetObjStoryBoundsAt
:GetObjStoryBoundsCnt
:GetStoryLayerInfo
:HasObjStoryBound
:HasObjStoryBounds
:SetObjectStoryBound

Procedure HWallHeight sets the wall heights of the referenced wall object.

```pascal
PROCEDURE HWallHeight(
				wallHd              : HANDLE;
				startHeightDistance : REAL;
				endHeightDistance   : REAL);
```

```python
def vs.HWallHeight(wallHd, startHeightDistance, endHeightDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wallHd|HANDLE|Handle to wall.|
|startHeightDistance|REAL|New start height of wall.|
|endHeightDistance|REAL|New end height of wall.|

## Remarks
You can also change the various heights of the wall with SetObjectVariableReal function calls.

604 StartHeightTop
605 StartHeightBottom
606 EndHeightTop
607 EndHeightBottom

## Examples
```pascal
HWallHeight(wallHd, 1.0, 2.0);
```
```python
import vs

# _Vectorworks 2012 Deprecated Functions_.
wallHd = vs.FSActLayer()  # handle to the first selected object on the active layer
startHeightDistance = 2.0
endHeightDistance = 2.0

vs.HWallHeight(wallHd, startHeightDistance, endHeightDistance)
```

## Version
Availability: from MiniCAD6.0
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Objects - Walls